org/blog/General/2022-04-30-its-alive.org
#+title: The site is up
#+DATE: <2022-04-30 17:59>
#+SUBTITLE: Even static sites are a PITA
#+AUTHOR: Morgan Walsh
#+DESCRIPTION: A simple article
#+KEYWORDS: org-mode emacs static-site
#+LANGUAGE: en

** It's alive!

After lots of head scratching, the site is alive! The site has been created using Emacs (via the Portacle package) and the built-in org-mode, the 
publishing utility of org-mode has been utilised to generate static HTML files from ~org~ files.

Keep an eye out for more posts surrounding setting up this blog with Emacs and org-mode. 
