blog/General/2022-04-30-its-alive.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2022-04-30 Sat 18:27 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>The site is up</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Morgan Walsh">
<meta name="description" content="A simple article"
>
<meta name="keywords" content="org-mode emacs static-site">
<link rel="stylesheet" href="/css/style.css" type="text/css" />
</head>
<body>
<div id="preamble" class="status">
<nav>
<ul>
<li><a href='/'>Home</a></li>
<li><a href='/blog'>Blog</a></li>
<li><a href='http://github.com/MrWalshyType2'>GitHub</a></li>
</ul>
</nav>
</div>
<div id="content">
<header>
<h1 class="title">The site is up</h1>
<p class="subtitle">Even static sites are a PITA</p>
</header>
<div id="outline-container-orgecbf12a" class="outline-2">
<h2 id="orgecbf12a">It's alive!</h2>
<div class="outline-text-2" id="text-orgecbf12a">
<p>
After lots of head scratching, the site is alive! The site has been created using Emacs (via the Portacle package) and the built-in org-mode, the 
publishing utility of org-mode has been utilised to generate static HTML files from <code>org</code> files.
</p>

<p>
Keep an eye out for more posts surrounding setting up this blog with Emacs and org-mode. 
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
Copyright 2022 Morgan Walsh ( HTML).<br>
Last updated 2022-04-30 Sat 18:26. <br>
Built with <a href="https://www.gnu.org/software/emacs/">Emacs</a> 26.3 (<a href="https://orgmode.org">Org</a> mode 9.1.9).
</footer>
</div>
</body>
</html>
